@jvascousa this was fixed with v1.5.0

Plan with the same config 
```
  # awscc_mediaconnect_flow_source.source_2 will be created
  + resource "awscc_mediaconnect_flow_source" "source_2" {
      + decryption              = (known after apply)
      + description             = "source_2"
      + entitlement_arn         = (known after apply)
      + flow_arn                = (known after apply)
      + gateway_bridge_source   = (known after apply)
      + id                      = (known after apply)
      + ingest_ip               = (known after apply)
      + ingest_port             = 5002
      + max_bitrate             = 20000
      + max_latency             = (known after apply)
      + min_latency             = (known after apply)
      + name                    = "source_2"
      + protocol                = "srt-listener"
      + sender_control_port     = (known after apply)
      + sender_ip_address       = (known after apply)
      + source_arn              = (known after apply)
      + source_ingest_port      = (known after apply)
      + source_listener_address = (known after apply)
      + source_listener_port    = (known after apply)
      + stream_id               = (known after apply)
      + vpc_interface_name      = (known after apply)
      + whitelist_cidr          = "0.0.0.0/0"
    }
```

Can you test this on your side ?